
const rng = new RNG(seed = Date.now());

const romaji_kana = {"a":"あ","A":"ア","i":"い","I":"イ","u":"う","U":"ウ","e":"え","E":"エ","o":"お","O":"オ","ka":"か","KA":"カ","ki":"き","KI":"キ","ku":"く","KU":"ク","ke":"け","KE":"ケ","ko":"こ","KO":"コ","sa":"さ","SA":"サ","shi":"し","SHI":"シ","su":"す","SU":"ス","se":"せ","SE":"セ","so":"そ","SO":"ソ","ta":"た","TA":"タ","chi":"ち","CHI":"チ","tsu":"つ","TSU":"ツ","te":"て","TE":"テ","to":"と","TO":"ト","na":"な","NA":"ナ","ni":"に","NI":"ニ","nu":"ぬ","NU":"ヌ","ne":"ね","NE":"ネ","no":"の","NO":"ノ","ha":"は","HA":"ハ","hi":"ひ","HI":"ヒ","fu":"ふ","FU":"フ","he":"へ","HE":"ヘ","ho":"ほ","HO":"ホ","ma":"ま","MA":"マ","mi":"み","MI":"ミ","mu":"む","MU":"ム","me":"め","ME":"メ","mo":"も","MO":"モ","ya":"や","YA":"ヤ","yu":"ゆ","YU":"ユ","yo":"よ","YO":"ヨ","ra":"ら","RA":"ラ","ri":"り","RI":"リ","ru":"る","RU":"ル","re":"れ","RE":"レ","ro":"ろ","RO":"ロ","wa":"わ","WA":"ワ","wo":"を","WO":"ヲ","n":"ん","N":"ン","kya":"きゃ","KYA":"キャ","kyu":"きゅ","KYU":"キュ","kyo":"きょ","KYO":"キョ","sha":"しゃ","SHA":"シャ","shu":"しゅ","SHU":"シュ","sho":"しょ","SHO":"ショ","cha":"ちゃ","CHA":"チャ","chu":"ちゅ","CHU":"チュ","cho":"ちょ","CHO":"チョ","nya":"にゃ","NYA":"ニャ","nyu":"にゅ","NYU":"ニュ","nyo":"にょ","NYO":"ニョ","hya":"ひゃ","HYA":"ヒャ","hyu":"ひゅ","HYU":"ヒュ","hyo":"ひょ","HYO":"ヒョ","mya":"みゃ","MYA":"ミャ","myu":"みゅ","MYU":"ミュ","myo":"みょ","MYO":"ミョ","rya":"りゃ","RYA":"リャ","ryu":"りゅ","RYU":"リュ","ryo":"りょ","RYO":"リョ","ga":"が","GA":"ガ","gi":"ぎ","GI":"ギ","gu":"ぐ","GU":"グ","ge":"げ","GE":"ゲ","go":"ご","GO":"ゴ","za":"ざ","ZA":"ザ","ji":"じ","JI":"ジ","zu":"ず","ZU":"ズ","ze":"ぜ","ZE":"ゼ","zo":"ぞ","ZO":"ゾ","da":"だ","DA":"ダ","di":"ぢ","DI":"ヂ","du":"づ","DU":"ヅ","de":"で","DE":"デ","do":"ど","DO":"ド","ba":"ば","BA":"バ","bi":"び","BI":"ビ","bu":"ぶ","BU":"ブ","be":"べ","BE":"ベ","bo":"ぼ","BO":"ボ","pa":"ぱ","PA":"パ","pi":"ぴ","PI":"ピ","pu":"ぷ","PU":"プ","pe":"ぺ","PE":"ペ","po":"ぽ","PO":"ポ","gya":"ぎゃ","GYA":"ギャ","gyu":"ぎゅ","GYU":"ギュ","gyo":"ぎょ","GYO":"ギョ","ja":"じゃ","JA":"ジャ","zya":"じゃ","ZYA":"ジャ","ju":"じゅ","JU":"ジュ","zyu":"じゅ","ZYU":"ジュ","jo":"じょ","JO":"ジョ","zyo":"じょ","ZYO":"ジョ","dya":"ぢゃ","DYA":"ヂャ","dyu":"ぢゅ","DYU":"ヂュ","dyo":"ぢょ","DYO":"ヂョ","bya":"びゃ","BYA":"ビャ","byu":"びゅ","BYU":"ビュ","byo":"びょ","BYO":"ビョ","pya":"ぴゃ","PYA":"ピャ","pyu":"ぴゅ","PYU":"ピュ","pyo":"ぴょ","PYO":"ピョ"}
const hiragana_romaji = {"あ":"a","い":"i","う":"u","え":"e","お":"o","か":"ka","き":"ki","く":"ku","け":"ke","こ":"ko","さ":"sa","し":"shi","す":"su","せ":"se","そ":"so","た":"ta","ち":"chi","つ":"tsu","て":"te","と":"to","な":"na","に":"ni","ぬ":"nu","ね":"ne","の":"no","は":"ha","ひ":"hi","ふ":"fu","へ":"he","ほ":"ho","ま":"ma","み":"mi","む":"mu","め":"me","も":"mo","や":"ya","ゆ":"yu","よ":"yo","ら":"ra","り":"ri","る":"ru","れ":"re","ろ":"ro","わ":"wa","を":"wo","ん":"n","きゃ":"kya","きゅ":"kyu","きょ":"kyo","しゃ":"sha","しゅ":"shu","しょ":"sho","ちゃ":"cha","ちゅ":"chu","ちょ":"cho","にゃ":"nya","にゅ":"nyu","にょ":"nyo","ひゃ":"hya","ひゅ":"hyu","ひょ":"hyo","みゃ":"mya","みゅ":"myu","みょ":"myo","りゃ":"rya","りゅ":"ryu","りょ":"ryo","が":"ga","ぎ":"gi","ぐ":"gu","げ":"ge","ご":"go","ざ":"za","じ":"ji","ず":"zu","ぜ":"ze","ぞ":"zo","だ":"da","ぢ":"di","づ":"du","で":"de","ど":"do","ば":"ba","び":"bi","ぶ":"bu","べ":"be","ぼ":"bo","ぱ":"pa","ぴ":"pi","ぷ":"pu","ぺ":"pe","ぽ":"po","ぎゃ":"gya","ぎゅ":"gyu","ぎょ":"gyo","じゃ":"ja","じゃ":"zya","じゅ":"ju","じゅ":"zyu","じょ":"jo","じょ":"zyo","ぢゃ":"dya","ぢゅ":"dyu","ぢょ":"dyo","びゃ":"bya","びゅ":"byu","びょ":"byo","ぴゃ":"pya","ぴゅ":"pyu","ぴょ":"pyo"}
const katakana_romaji = {"ア":"A","イ":"I","ウ":"U","エ":"E","オ":"O","カ":"KA","キ":"KI","ク":"KU","ケ":"KE","コ":"KO","サ":"SA","シ":"SHI","ス":"SU","セ":"SE","ソ":"SO","タ":"TA","チ":"CHI","ツ":"TSU","テ":"TE","ト":"TO","ナ":"NA","ニ":"NI","ヌ":"NU","ネ":"NE","ノ":"NO","ハ":"HA","ヒ":"HI","フ":"FU","ヘ":"HE","ホ":"HO","マ":"MA","ミ":"MI","ム":"MU","メ":"ME","モ":"MO","ヤ":"YA","ユ":"YU","ヨ":"YO","ラ":"RA","リ":"RI","ル":"RU","レ":"RE","ロ":"RO","ワ":"WA","ヲ":"WO","ン":"N","キャ":"KYA","キュ":"KYU","キョ":"KYO","シャ":"SHA","シュ":"SHU","ショ":"SHO","チャ":"CHA","チュ":"CHU","チョ":"CHO","ニャ":"NYA","ニュ":"NYU","ニョ":"NYO","ヒャ":"HYA","ヒュ":"HYU","ヒョ":"HYO","ミャ":"MYA","ミュ":"MYU","ミョ":"MYO","リャ":"RYA","リュ":"RYU","リョ":"RYO","ガ":"GA","ギ":"GI","グ":"GU","ゲ":"GE","ゴ":"GO","ザ":"ZA","ジ":"JI","ズ":"ZU","ゼ":"ZE","ゾ":"ZO","ダ":"DA","ヂ":"DI","ヅ":"DU","デ":"DE","ド":"DO","バ":"BA","ビ":"BI","ブ":"BU","ベ":"BE","ボ":"BO","パ":"PA","ピ":"PI","プ":"PU","ペ":"PE","ポ":"PO","ギャ":"GYA","ギュ":"GYU","ギョ":"GYO","ジャ":"JA","ジャ":"ZYA","ジュ":"JU","ジュ":"ZYU","ジョ":"JO","ジョ":"ZYO","ヂャ":"DYA","ヂュ":"DYU","ヂョ":"DYO","ビャ":"BYA","ビュ":"BYU","ビョ":"BYO","ピャ":"PYA","ピュ":"PYU","ピョ":"PYO"}
const hiragana_katakana = {"あ":"ア","い":"イ","う":"ウ","え":"エ","お":"オ","か":"カ","き":"キ","く":"ク","け":"ケ","こ":"コ","さ":"サ","し":"シ","す":"ス","せ":"セ","そ":"ソ","た":"タ","ち":"チ","つ":"ツ","て":"テ","と":"ト","な":"ナ","に":"ニ","ぬ":"ヌ","ね":"ネ","の":"ノ","は":"ハ","ひ":"ヒ","ふ":"フ","へ":"ヘ","ほ":"ホ","ま":"マ","み":"ミ","む":"ム","め":"メ","も":"モ","や":"ヤ","ゆ":"ユ","よ":"ヨ","ら":"ラ","り":"リ","る":"ル","れ":"レ","ろ":"ロ","わ":"ワ","を":"ヲ","ん":"ン","きゃ":"キャ","きゅ":"キュ","きょ":"キョ","しゃ":"シャ","しゅ":"シュ","しょ":"ショ","ちゃ":"チャ","ちゅ":"チュ","ちょ":"チョ","にゃ":"ニャ","にゅ":"ニュ","にょ":"ニョ","ひゃ":"ヒャ","ひゅ":"ヒュ","ひょ":"ヒョ","みゃ":"ミャ","みゅ":"ミュ","みょ":"ミョ","りゃ":"リャ","りゅ":"リュ","りょ":"リョ","が":"ガ","ぎ":"ギ","ぐ":"グ","げ":"ゲ","ご":"ゴ","ざ":"ザ","じ":"ジ","ず":"ズ","ぜ":"ゼ","ぞ":"ゾ","だ":"ダ","ぢ":"ヂ","づ":"ヅ","で":"デ","ど":"ド","ば":"バ","び":"ビ","ぶ":"ブ","べ":"ベ","ぼ":"ボ","ぱ":"パ","ぴ":"ピ","ぷ":"プ","ぺ":"ペ","ぽ":"ポ","ぎゃ":"ギャ","ぎゅ":"ギュ","ぎょ":"ギョ","じゃ":"ジャ","じゅ":"ジュ","じょ":"ジョ","ぢゃ":"ヂャ","ぢゅ":"ヂュ","ぢょ":"ヂョ","びゃ":"ビャ","びゅ":"ビュ","びょ":"ビョ","ぴゃ":"ピャ","ぴゅ":"ピュ","ぴょ":"ピョ"}
const katakana_hiragana = {"ア":"あ","イ":"い","ウ":"う","エ":"え","オ":"お","カ":"か","キ":"き","ク":"く","ケ":"け","コ":"こ","サ":"さ","シ":"し","ス":"す","セ":"せ","ソ":"そ","タ":"た","チ":"ち","ツ":"つ","テ":"て","ト":"と","ナ":"な","ニ":"に","ヌ":"ぬ","ネ":"ね","ノ":"の","ハ":"は","ヒ":"ひ","フ":"ふ","ヘ":"へ","ホ":"ほ","マ":"ま","ミ":"み","ム":"む","メ":"め","モ":"も","ヤ":"や","ユ":"ゆ","ヨ":"よ","ラ":"ら","リ":"り","ル":"る","レ":"れ","ロ":"ろ","ワ":"わ","ヲ":"を","ン":"ん","キャ":"きゃ","キュ":"きゅ","キョ":"きょ","シャ":"しゃ","シュ":"しゅ","ショ":"しょ","チャ":"ちゃ","チュ":"ちゅ","チョ":"ちょ","ニャ":"にゃ","ニュ":"にゅ","ニョ":"にょ","ヒャ":"ひゃ","ヒュ":"ひゅ","ヒョ":"ひょ","ミャ":"みゃ","ミュ":"みゅ","ミョ":"みょ","リャ":"りゃ","リュ":"りゅ","リョ":"りょ","ガ":"が","ギ":"ぎ","グ":"ぐ","ゲ":"げ","ゴ":"ご","ザ":"ざ","ジ":"じ","ズ":"ず","ゼ":"ぜ","ゾ":"ぞ","ダ":"だ","ヂ":"ぢ","ヅ":"づ","デ":"で","ド":"ど","バ":"ば","ビ":"び","ブ":"ぶ","ベ":"べ","ボ":"ぼ","パ":"ぱ","ピ":"ぴ","プ":"ぷ","ペ":"ぺ","ポ":"ぽ","ギャ":"ぎゃ","ギュ":"ぎゅ","ギョ":"ぎょ","ジャ":"じゃ","ジュ":"じゅ","ジョ":"じょ","ヂャ":"ぢゃ","ヂュ":"ぢゅ","ヂョ":"ぢょ","ビャ":"びゃ","ビュ":"びゅ","ビョ":"びょ","ピャ":"ぴゃ","ピュ":"ぴゅ","ピョ":"ぴょ"}

const loadedQuestions = {};
const userData = {
	testData: {
		correct: 0,
		incorrect: 0,
		questionPool: [],
		probabilityWeights: [],
		currentQuestion: undefined,
		currentQuestionIndex: -1,
	},
	testSettings: {
		questionDisplay: "kana",
		answerDisplay: "kanji",
		numAnswers: 2,
		furigana: false,
		romaji: false,
	},
};

const exampleData = {kanji:"例",kunyomi:["たと","える"],onyomi:["レイ"],english:"Example"}
const noneData = {kanji:"",kunyomi:[],onyomi:[],english:""}
const symbolTypes = ['kanji', 'english', 'kana'];

const answerBoxes = [];
const loadedSVGs = {};

const strokeColors = [
	"#1f77b4",
	"#ff7f0e",
	"#2ca02c",
	"#d62728",
	"#9467bd",
	"#8c564b",
	"#e377c2",
	"#7f7f7f",
	"#bcbd22",
	"#17becf",
	"#ffbb78",
	"#98df8a",
	"#ff9896",
	"#c5b0d5",
	"#c49c94",
	"#f7b6d2",
	"#c7c7c7",
	"#dbdb8d",
	"#9edae5",
	"#aec7e8",
	"#ff9da7",
	"#2f4f4f",
	"#ff6347",
	"#4682b4",
	"#dda0dd",
	"#b0e0e6",
	"#800000",
	"#b22222",
	"#ff69b4",
	"#556b2f",
]

/*
#1f77b4 (Blue)
#ff7f0e (Orange)
#2ca02c (Green)
#d62728 (Red)
#9467bd (Purple)
#8c564b (Brown)
#e377c2 (Pink)
#7f7f7f (Gray)
#bcbd22 (Olive)
#17becf (Teal)
#ffbb78 (Light Orange)
#98df8a (Light Green)
#ff9896 (Light Red)
#c5b0d5 (Light Purple)
#c49c94 (Light Brown)
#f7b6d2 (Light Pink)
#c7c7c7 (Light Gray)
#dbdb8d (Light Olive)
#9edae5 (Light Teal)
#aec7e8 (Light Blue)
#ff9da7 (Coral)
#2f4f4f (Dark Slate Gray)
#ff6347 (Tomato)
#4682b4 (Steel Blue)
#dda0dd (Plum)
#b0e0e6 (Powder Blue)
#800000 (Maroon)
#b22222 (Firebrick)
#ff69b4 (Hot Pink)
#556b2f (Dark Olive Green)
*/